app/views/books/show.html.erb

            <h2 class="page-header">Categories of this book</h2>
            <% @book.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."book_id" = ?  [["book_id", 2]]