app/controllers/books_controller.rb

  def index
    @search = Book.search(params[:q])
---
SELECT "books".* FROM "books"  WHERE (Title like '%asdfasd%')  ORDER BY created_at DESC

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "dsds"], ["created_at", Sat, 12 Apr 2014 07:42:48 UTC +00:00], ["description", "dsds"], ["title", "dsdsd"], ["updated_at", Sat, 12 Apr 2014 07:42:48 UTC +00:00]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "books"."id" = 5  [["image_file_name", "3.jpg"], ["image_file_size", 216326], ["image_updated_at", Sat, 12 Apr 2014 14:24:15 UTC +00:00], ["updated_at", Sat, 12 Apr 2014 14:24:15 UTC +00:00]]

  def destroy
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]

    def set_book
      @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books"  WHERE "books"."id" = ? LIMIT 1  [["id", "all"]]