app/controllers/categories_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "categories" ("book_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 2], ["created_at", Sat, 12 Apr 2014 11:22:15 UTC +00:00], ["name", "Tu su"], ["updated_at", Sat, 12 Apr 2014 11:22:15 UTC +00:00]]
---
	def create
	    @book = Book.find(params[:book_id])
	    @category = @book.categories.create(category_params)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "categories".* FROM "categories" WHERE "categories"."book_id" = ? AND "categories"."id" = ? LIMIT 1  [["book_id", 2], ["id", "1"]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
---
 	def destroy
	    @book = Book.find(params[:book_id])
	    @category = @book.categories.find(params[:id])
	    @category.destroy